jamesmunns/kinetis-rs/platform/drivers/lpuart/src/fsl_lpuart_driver.c
/********************* Private Functions -- START -- **************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_DRV_StartSendData
 * Description   : Initiate (start) a transmit by beginning the process of
 * sending data and enabling the interrupt.
 * This is not a public API as it is called from other driver functions.
 *
 *END**************************************************************************/
static lpuart_status_t LPUART_DRV_StartSendData(uint32_t instance, 
                                                const uint8_t * txBuff,
                                                uint32_t txSize)
{
    assert(instance < HW_LPUART_INSTANCE_COUNT);

    uint32_t baseAddr = g_lpuartBaseAddr[instance];
    lpuart_state_t * lpuartState = (lpuart_state_t *)g_lpuartStatePtr[instance];

    /* Check that we're not busy already transmitting data from a previous function call. */
    if (lpuartState->isTxBusy)
    {
        return kStatus_LPUART_TxBusy;
    }

    /* initialize the module driver state struct  */
    lpuartState->txBuff = txBuff;
    lpuartState->txSize = txSize;
    lpuartState->isTxBusy = true;

    /* Transmit the data */
    LPUART_HAL_Putchar(baseAddr, *(lpuartState->txBuff));
    ++lpuartState->txBuff;
    --lpuartState->txSize;

    /* enable transmission complete interrupt */
    LPUART_HAL_SetTxDataRegEmptyIntCmd(baseAddr, true);

    return kStatus_LPUART_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_DRV_CompleteSendData
 * Description   : Finish up a transmit by completing the process of sending 
 * data and disabling the interrupt. 
 * This is not a public API as it is called from other driver functions.
 *
 *END**************************************************************************/
static void LPUART_DRV_CompleteSendData(uint32_t instance)
{
    assert(instance < HW_UART_INSTANCE_COUNT);

    uint32_t baseAddr = g_lpuartBaseAddr[instance];
    lpuart_state_t * lpuartState = (lpuart_state_t *)g_lpuartStatePtr[instance];

    /* disable transmission complete interrupt */
    LPUART_HAL_SetTxDataRegEmptyIntCmd(baseAddr, false);

    /* Signal the synchronous completion object. */
    if (lpuartState->isTxBlocking) 
    {
        OSA_SemaPost(&lpuartState->txIrqSync);
    }

    /* Update the information of the module driver state */
    lpuartState->isTxBusy = false;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_DRV_StartReceiveData
 * Description   : Initiate (start) a receive by beginning the process of
 * receiving data and enabling the interrupt. 
 * This is not a public API as it is called from other driver functions.
 *
 *END**************************************************************************/
static lpuart_status_t LPUART_DRV_StartReceiveData(uint32_t instance, 
                                                   uint8_t * rxBuff,
                                                   uint32_t rxSize)
{
    assert(instance < HW_LPUART_INSTANCE_COUNT);

    lpuart_state_t * lpuartState = (lpuart_state_t *)g_lpuartStatePtr[instance];
    uint32_t baseAddr = g_lpuartBaseAddr[instance];

    /* Check that we're not busy already receiving data from a previous function call. */
    if (lpuartState->isRxBusy)
    {
        return kStatus_LPUART_RxBusy;
    }

    /* initialize the module driver state struct to indicate transfer in progress 
     * and with the buffer and byte count data. */
    lpuartState->isRxBusy = true;
    lpuartState->rxBuff = rxBuff;
    lpuartState->rxSize = rxSize;

    /* enable the receive data full interrupt */
    LPUART_HAL_SetRxDataRegFullIntCmd(baseAddr, true);

    /* As the LPUART does not have FIFO, so it's easy that the receive run into
     * overrun status. So in the LPUART driver, we should enable the overrun
     * interrupt, and clear the overrun flag when it happen. */
    LPUART_HAL_SetIntMode(baseAddr, kLpuartIntRxOverrun, true);

    return kStatus_LPUART_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_DRV_CompleteReceiveData
 * Description   : Finish up a receive by completing the process of receiving data
 * and disabling the interrupt. 
 * This is not a public API as it is called from other driver functions.
 *
 *END**************************************************************************/
static void LPUART_DRV_CompleteReceiveData(uint32_t instance)
{
    assert(instance < HW_LPUART_INSTANCE_COUNT);

    lpuart_state_t * lpuartState = (lpuart_state_t *)g_lpuartStatePtr[instance];
    uint32_t baseAddr = g_lpuartBaseAddr[instance];

    /* disable receive data full and rx overrun interrupt. */
    LPUART_HAL_SetRxDataRegFullIntCmd(baseAddr, false);
    LPUART_HAL_SetIntMode(baseAddr, kLpuartIntRxOverrun, true);

    /* Signal the synchronous completion object. */
    if (lpuartState->isRxBlocking) 
    {
        OSA_SemaPost(&lpuartState->rxIrqSync);
    }

    /* Update the information of the module driver state */
    lpuartState->isRxBusy = false; 
}

/*********************** Private Functions -- END -- **************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_DRV_SendDataBlocking
 * Description   : This function sends (transmits) data out through the LPUART module using a
 *                 blocking method.
 * A blocking (also known as synchronous) function means that the function does not return until
 * the transmit is complete. This blocking function is used to send data through the LPUART port.
 *
 *END**************************************************************************/
lpuart_status_t LPUART_DRV_SendDataBlocking(uint32_t instance, 
                                            const uint8_t * txBuff, 
                                            uint32_t txSize,
                                            uint32_t timeout)
{
    assert(txBuff);
    assert(instance < HW_LPUART_INSTANCE_COUNT);

    lpuart_state_t * lpuartState = (lpuart_state_t *)g_lpuartStatePtr[instance];
    osa_status_t syncStatus;

    /* Indicates this is a blocking transaction. */
    lpuartState->isTxBlocking = true;
    
