jamesmunns/kinetis-rs/platform/drivers/lpuart/src/fsl_lpuart_driver.c
    /* Indicates this is a non-blocking transaction. */
    lpuartState->isRxBlocking = false;

    if (LPUART_DRV_StartReceiveData(instance, rxBuff, rxSize) == kStatus_LPUART_RxBusy)
    {
        return kStatus_LPUART_RxBusy;
    }

    return kStatus_LPUART_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_DRV_GetReceiveStatus
 * Description   : This function returns whether the previous LPUART receive is complete.
 * When performing an async receive, the user can call this function to ascertain the state of the
 * current receive progress: in progress (or busy) or complete (success). In addition, if the
 * receive is still in progress, the user can obtain the number of words that have been
 * currently received.
 *
 *END**************************************************************************/
lpuart_status_t LPUART_DRV_GetReceiveStatus(uint32_t instance, uint32_t * bytesRemaining)
{
    assert(instance < HW_LPUART_INSTANCE_COUNT);

    lpuart_state_t * lpuartState = (lpuart_state_t *)g_lpuartStatePtr[instance];

    /* Fill in the bytes transferred. */
    if (bytesRemaining)
    {
        *bytesRemaining = lpuartState->rxSize;
    }

    return (lpuartState->isRxBusy ? kStatus_LPUART_RxBusy : kStatus_LPUART_Success);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_DRV_AbortReceivingData
 * Description   : This function shuts down the LPUART by disabling interrupts and the
 *                 transmitter/receiver.
 * This function disables the LPUART interrupts, disables the transmitter and receiver, and
 * flushes the FIFOs (for modules that support FIFOs).
 *
 *END**************************************************************************/
lpuart_status_t LPUART_DRV_AbortReceivingData(uint32_t instance)
{
    assert(instance < HW_LPUART_INSTANCE_COUNT);

    lpuart_state_t * lpuartState = (lpuart_state_t *)g_lpuartStatePtr[instance];

    /* Check if a transfer is running. */
    if (!lpuartState->isRxBusy)
    {
        return kStatus_LPUART_NoReceiveInProgress;
    }

    /* Stop the running transfer. */
    LPUART_DRV_CompleteReceiveData(instance);

    return kStatus_LPUART_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_DRV_IRQHandler
 * Description   : Interrupt handler for LPUART.
 * This handler uses the buffers stored in the lpuart_state_t structs to transfer data.
 * This is not a public API as it is called whenever an interrupt occurs.
 *
 *END**************************************************************************/
void LPUART_DRV_IrqHandler(uint32_t instance)
{
    lpuart_state_t * lpuartState = g_lpuartStatePtr[instance];
    uint32_t baseAddr = g_lpuartBaseAddr[instance];

    /* Exit the ISR if no transfer is happening for this instance. */
    if ((!lpuartState->isTxBusy) && (!lpuartState->isRxBusy))
    {
        return;
    }

    /* check to see if the interrupt is due to transmit complete */
    /* first see if the interrupt is enabled */
    if (LPUART_HAL_GetTxDataRegEmptyIntCmd(baseAddr))
    {
        if(LPUART_HAL_IsTxDataRegEmpty(baseAddr))
        {
            /* check to see if there are any more bytes to send */
            if (lpuartState->txSize)
            {
                /* Transmit the data */
               LPUART_HAL_Putchar(baseAddr, *(lpuartState->txBuff)); 
               ++lpuartState->txBuff;
               --lpuartState->txSize; 
            }
            else
            {
                /* We're done with this transfer. Complete the transfer.
                 * This disables the interrupts, so we don't wind up in the ISR again. */
                LPUART_DRV_CompleteSendData(instance);
            }
        }
    }

    /* check to see if the interrupt is due to receive data full */
    /* first see if the interrupt is enabled */
    if(LPUART_HAL_GetRxDataRegFullIntCmd(baseAddr))
    {
        if(LPUART_HAL_IsRxDataRegFull(baseAddr))
        {
            /* get data and put in receive buffer  */
            LPUART_HAL_Getchar(baseAddr, lpuartState->rxBuff);
            ++lpuartState->rxBuff;
            --lpuartState->rxSize;

            /* Check to see if this was the last byte received */
            if ((lpuartState->rxSize == 0))
            {
                /* Complete the transfer. This disables the interrupts, so we don't wind up in */
                /* the ISR again. */
                LPUART_DRV_CompleteReceiveData(instance);
            }
        }
    }

    /* Clear LPUART rx overrun flag. */
    if (LPUART_HAL_GetStatusFlag(baseAddr, kLpuartRxOverrun))
    {
        LPUART_HAL_ClearStatusFlag(baseAddr, kLpuartRxOverrun);
    }
}

/*******************************************************************************
 * EOF
 ******************************************************************************/

